yii/backend/controllers/MainController.php

SELECT COUNT(*) FROM `user`
SELECT * FROM `user` LIMIT 2
---
    public function actionIndex(){
        //调用模型层
        $query = User::find();
        //调用分页类
        $pages = new Pagination([
            'totalCount' => $query->count(),
            'pageSize'=>2,
        ]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->asArray()
            ->all();

SELECT COUNT(*) FROM `room`
SELECT * FROM `room` LIMIT 3
---
    public function actionTables(){
        //调用模型层
        $query = Room::find();
        //调用分页类
        $pages = new Pagination([
            'totalCount' => $query->count(),
            'pageSize'=>10,
        ]);